# RevitServerException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitServerException Class
Members See Also
---
The exception that is base class for all exceptions originating from the Revit server.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class RevitServerException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class RevitServerException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class RevitServerException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..RevitServerException Autodesk.Revit.Exceptions..::..RevitServerCollaborationNotAvailableException Autodesk.Revit.Exceptions..::..RevitServerCommunicationException Autodesk.Revit.Exceptions..::..RevitServerInternalException Autodesk.Revit.Exceptions..::..RevitServerModelAlreadyExistsException Autodesk.Revit.Exceptions..::..RevitServerModelNameBreaksConventionException Autodesk.Revit.Exceptions..::..RevitServerUnauthenticatedUserException Autodesk.Revit.Exceptions..::..RevitServerUnauthorizedException
# See Also
RevitServerException Members
Autodesk.Revit.Exceptions Namespace